export const videoGuides = [
  { id: 1, text: "فيديو توضيحي" },
  { id: 2, text: "فيديو توضيحي" },
  { id: 3, text: "فيديو توضيحي" },
  { id: 4, text: "فيديو توضيحي" },
];

export const registrationSteps = [
  {
    id: 1,
    text: "للتسجيل لاول مره يتم الضغط على قائمة طلب الترقية/ استكمال البيانات",
  },
  {
    id: 2,
    text: "الضغط على مستخدم جديد ثم تسجيل البيانات التاليه (اسم الباحث - البريد الالكتروني - الرقم القومى - رقم الهاتف) ثم الضغط على (حفظ)",
  },
  {
    id: 3,
    text: "سيقوم النظام بإرسال كود تفعيل على البريد الالكترونى الخاص بالباحث.",
  },
  {
    id: 4,
    text: "لتسجيل الدخول يتم ادخال البريد الالكترونى او الرقم القومي و كود التأكيد الذى تم استلامه على البريد الالكترونى ومن ثم الضغط على تسجيل الدخول",
  },
  { id: 5, text: "من قائمة طلباتي يتم الضغط على إضافة طلب جديد" },
  {
    id: 6,
    text: "سيتم تحويلكم على شاشة تسجيل طلب جديد والتي يتم فيها إضافة بيانات الباحث ومن ثم حفظ البيانات",
  },
];

export const basicDataSteps = [
  {
    id: 1,
    text: "سيتم تحويلكم على شاشة تسجيل طلب جديد والتي يتم فيها إضافة بيانات الباحث ومن ثم حفظ البيانات",
  },
  { id: 2, text: "الضغط على حفظ بعد الانتهاء" },
];

export const acceptedRequestSteps = [
  { id: 1, text: "ضغط على إجراءات و من ثم الضغط على مرفقات الطلب" },
  { id: 2, text: "يتم رفع الملفات الخاصة بالطلب و ادخال البيانات" },
  { id: 3, text: "يتم تغيير حالة الطلب" },
];

export const rejectedRequestSteps = [
  {
    id: 1,
    text: "ضغط على إجراءات و من ثم الضغط على عرض لأسباب الرفض و الملاحظات",
  },
  { id: 2, text: "الضغط على تعديل للقبول و من ثم الضغط على إعادة ارسال" },
  { id: 3, text: "طرق أخرى" },
];
